src/cfe/ИнтеграцияСRabbitMQ/InformationRegisters/RMQ_НастройкиМаршрутизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>RMQ_НастройкиМаршрутизации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТочкаОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RMQ_ТочкиОбмена</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Очередь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RMQ_Очереди</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючМаршрутизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/ИнтеграцияСRabbitMQ/Catalogs/RMQ_ТочкиОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>RMQ_ТочкиОбмена</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипТочкиОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.RMQ_ТипыТочекОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВиртуальныйХост</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RMQ_ВиртуальныеХосты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/ИнтеграцияСRabbitMQ/Catalogs/RMQ_Очереди.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>RMQ_Очереди</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВиртуальныйХост</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RMQ_ВиртуальныеХосты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/ИнтеграцияСRabbitMQ/InformationRegisters/RMQ_НастройкиМаршрутизации/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	RMQ_НастройкиМаршрутизации.ТочкаОбмена КАК ТочкаОбмена,
		|	RMQ_НастройкиМаршрутизации.Очередь КАК Очередь,
		|	RMQ_НастройкиМаршрутизации.КлючМаршрутизации КАК КлючМаршрутизации,
		|	RMQ_НастройкиМаршрутизации.Действует КАК Действует
		|ИЗ
		|	РегистрСведений.RMQ_НастройкиМаршрутизации КАК RMQ_НастройкиМаршрутизации
		|ГДЕ
		|	ИСТИНА";
	
	Для Каждого ЭлементОтбора Из Отбор Цикл
		Запрос.Текст = Запрос.Текст + " И " + ЭлементОтбора.Имя + " = &" + ЭлементОтбора.Имя;
		Запрос.УстановитьПараметр(ЭлементОтбора.Имя, ЭлементОтбора.Значение);
	КонецЦикла;

	РезультатЗапроса = Запрос.Выполнить();
	
	ДополнительныеСвойства.Вставить("ДействующиеНастройки", РезультатЗапроса.Выгрузить());
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	КлиентКомпоненты = RMQ_ОбменСообщениями.ПолучитьКомпонентуСервер();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДействующиеНастройки.ТочкаОбмена КАК ТочкаОбмена,
		|	ДействующиеНастройки.Очередь КАК Очередь,
		|	ДействующиеНастройки.КлючМаршрутизации КАК КлючМаршрутизации
		|ПОМЕСТИТЬ ВТ_ДействующиеНастройки
		|ИЗ
		|	&ДействующиеНастройки КАК ДействующиеНастройки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НовыеНастройки.ТочкаОбмена КАК ТочкаОбмена,
		|	НовыеНастройки.Очередь КАК Очередь,
		|	НовыеНастройки.КлючМаршрутизации КАК КлючМаршрутизации,
		|	НовыеНастройки.Действует КАК Действует
		|ПОМЕСТИТЬ ВТ_НовыеНастройки
		|ИЗ
		|	&НовыеНастройки КАК НовыеНастройки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВЫРАЗИТЬ(ДействующиеНастройки.ТочкаОбмена КАК Справочник.RMQ_ТочкиОбмена).ВиртуальныйХост, ВЫРАЗИТЬ(НовыеНастройки.ТочкаОбмена КАК Справочник.RMQ_ТочкиОбмена).ВиртуальныйХост) КАК ВиртуальныйХост,
		|	ВЫБОР
		|		КОГДА ДействующиеНастройки.ТочкаОбмена ЕСТЬ NULL
		|				И НовыеНастройки.Действует
		|			ТОГДА ""Добавить""
		|		ИНАЧЕ ""Удалить""
		|	КОНЕЦ КАК Действие,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(ДействующиеНастройки.ТочкаОбмена, НовыеНастройки.ТочкаОбмена) КАК Справочник.RMQ_ТочкиОбмена).Наименование КАК ТочкаОбмена,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(ДействующиеНастройки.ТочкаОбмена, НовыеНастройки.ТочкаОбмена) КАК Справочник.RMQ_ТочкиОбмена).Действует КАК ТочкаОбменаДействует,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(ДействующиеНастройки.Очередь, НовыеНастройки.Очередь) КАК Справочник.RMQ_Очереди).Наименование КАК Очередь,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(ДействующиеНастройки.Очередь, НовыеНастройки.Очередь) КАК Справочник.RMQ_Очереди).Действует КАК ОчередьДействует,
		|	ЕСТЬNULL(ДействующиеНастройки.КлючМаршрутизации, НовыеНастройки.КлючМаршрутизации) КАК КлючМаршрутизации
		|ИЗ
		|	ВТ_ДействующиеНастройки КАК ДействующиеНастройки
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_НовыеНастройки КАК НовыеНастройки
		|		ПО ДействующиеНастройки.ТочкаОбмена = НовыеНастройки.ТочкаОбмена
		|			И ДействующиеНастройки.Очередь = НовыеНастройки.Очередь
		|ИТОГИ
		|	МИНИМУМ(ТочкаОбменаДействует),
		|	МИНИМУМ(ОчередьДействует)
		|ПО
		|	ВиртуальныйХост";
	
	Запрос.УстановитьПараметр("ДействующиеНастройки", ДополнительныеСвойства.ДействующиеНастройки);
	Запрос.УстановитьПараметр("НовыеНастройки", Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаВиртуальныйХост = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаВиртуальныйХост.Следующий() Цикл                                             
		ТочкаОбменаИОчередьДействуют = ВыборкаВиртуальныйХост.ТочкаОбменаДействует И ВыборкаВиртуальныйХост.ОчередьДействует;
		
		Если ТочкаОбменаИОчередьДействуют Тогда
			НастройкиПодключения = RMQ_ОбменСообщениями.ПолучитьНастройкиПодключенияRabbitMQ(ВыборкаВиртуальныйХост.ВиртуальныйХост);
			
			Попытка
				КлиентКомпоненты.Connect(
					НастройкиПодключения.Адрес,
					НастройкиПодключения.Порт,
					НастройкиПодключения.ИмяПользователя,
					НастройкиПодключения.Пароль,
					НастройкиПодключения.ВиртуальныйХост);
			Исключение
				СистемнаяОшибка = ОписаниеОшибки();
				ТекстСообщения = "Ошибка соединения с RabbitMQ!%СистемнаяОшибка%";
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
				ВызватьИсключение ТекстСообщения;
			КонецПопытки;
		КонецЕсли;
			
		ВыборкаДетальныеЗаписи = ВыборкаВиртуальныйХост.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если НЕ ВыборкаДетальныеЗаписи.ТочкаОбменаДействует Тогда
				Отказ = Истина;
				Сообщить(СтрШаблон(НСтр("ru = 'Точка обмена %1 не действует! Нельзя сделать привязку!'"), ВыборкаДетальныеЗаписи.ТочкаОбмена));
			КонецЕсли;
			
			Если НЕ ВыборкаДетальныеЗаписи.ОчередьДействует Тогда
				Отказ = Истина;
				Сообщить(СтрШаблон(НСтр("ru = 'Очередь %1 не действует! Нельзя сделать привязку!'"), ВыборкаДетальныеЗаписи.Очередь));
			КонецЕсли;
			
			Если ТочкаОбменаИОчередьДействуют Тогда
				Попытка
					Если ВыборкаДетальныеЗаписи.Действие = "Добавить" Тогда
						КлиентКомпоненты.BindQueue(ВыборкаДетальныеЗаписи.Очередь, ВыборкаДетальныеЗаписи.ТочкаОбмена, ВыборкаДетальныеЗаписи.КлючМаршрутизации);
						Сообщить("Привязка очереди к точке обмена успешно выполнена!");
					Иначе
						КлиентКомпоненты.UnbindQueue(ВыборкаДетальныеЗаписи.Очередь, ВыборкаДетальныеЗаписи.ТочкаОбмена, ВыборкаДетальныеЗаписи.КлючМаршрутизации);
						Сообщить("Отвязка очереди от точки обмена успешно выполнена!");
					КонецЕсли;
				Исключение
					СистемнаяОшибка = ОписаниеОшибки();
					ТекстСообщения = "Ошибка создания точек и очередей!%СистемнаяОшибка%";
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
					ВызватьИсключение ТекстСообщения;
				КонецПопытки;				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
